{
  "basics": {
    "name": "Caio Kinzel Filho",
    "label": "Consultant Developer",
    "picture": "http://www.gravatar.com/avatar/82c169bc19ec0a21b7fbcd2043fd4ad2.png",
    "email": "caiokf@gmail.com",
    "phone": "",
    "summary": "Software developer and agilist with 10+ years of experience building web application from small businesses to large enterprises. Focused on writing good and maintainable code and providing maximum value for clients.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Porto Alegre",
      "countryCode": "BR",
      "region": "Rio Grande do Sul"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "caiokf",
        "url": "https://github.com/caiokf"
      }
    ]
  },
  "languages": [
    {
      "language": "Portuguese",
      "fluency": "Native Speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Spanish",
      "fluency": "Intermediate"
    }
  ],
  "work": [{
    "company": "Farmácias Aguiar / HOS",
    "position": "Technical Lead",
    "website": "http://hos.com.br",
    "startDate": "2007-02-01",
    "endDate": "2009-09-01",
    "summary": "A software design house working in the field of pharmaceutical software systems. Initially I developed a few independent systems in C#, motivating the company to migrate their products from VB6. The team consisted of 12 developers and QAs who only had experience with Visual Basic 6 and manual testing experiences, together with a few product owners and business analysts shared between this project's and another teams. I provided training for the developers and QA team, on Agile  methodologies, Object-Oriented Design, C# and automated tests for smart client platforms, designed a Continuous Integration environment and started the project architecture and kick-off using Windows  Forms, WCF and ALT.NET stack.",
    "highlights": [
      "C#, Visual Basic, MSSQL, Firebird",
      "Full project life-cycle experience",
      "Working closely with business experts",
      "Migration from VB6 to .NET technologies",
      "Onboarding team members onto Agile practices"
    ]
  },
  {
    "company": "TOTVS",
    "position": "Senior Web Developer",
    "website": "http://totvs.com",
    "startDate": "2009-09-01",
    "endDate": "2010-02-01",
    "summary": "This software factory works in the field of hospital management systems inside a large Enterprise of ERP systems. The product is used on some of the largest hospitals in Brazil, managing most of their processes and integrating with ERP systems, built using ASP.NET WebForms, AJAX  and COM+ technologies, with Oracle and MS SQL Server databases. The project had 15+ years old and was maintained by 50 developers using RUP methodologies. I worked as a developer and helped in the transition from old VCS to Subversion and advocated the use of Continuous Integration and unit testing practices that was later adopted by the company",
    "highlights": [
      "C#, MSSQL, Oracle",
      "Large enterprise multi-tenant software",
      "Microsoft Workflow Foundation experience"
    ]
  },
  {
    "company": "Conceito Web",
    "position": "Freelancer Web Developer",
    "website": "http://conceitoweb.com.br",
    "startDate": "2007-09-01",
    "endDate": "2008-02-01",
    "summary": "This digital design company was hired to build an e-commerce portal solution for a large client. This project consisted on a concept they called \"virtual shopping center\", where users could buy an e-commerce store on-line  and customize it. This solution was a greenfield application, though it needed to integrate with some systems and had some restrictions on the programming language, with certain architectural decisions required by the client. I was brought in to design the solution architecture and the development kick-off of the project working with a Product Owner, a Project Manager, and 7 Application/Database developers through the completion of the project. This project was develop in VB.NET and ASP.NET WebForms technology in a mix of Waterfall and Iterative methodologies, with the a closed-scope defined prior to the start of the project and a very short  deadline.",
    "highlights": [
      "VB.NET, MSSQL",
      "E-commerce multi-tiered application",
      "Responsible for architecture definition"
    ]
  },
  {
    "company": "Solon Tavares Technical State School",
    "position": "Trainer",
    "website": "http://solontavares.com/",
    "startDate": "2006-05-01",
    "endDate": "2007-011-01",
    "summary": "Part time trainer on this state-run technical school, teaching subjects on the course of Software Development and Analysis. Among some of the subjects taught are: Software  Development, Systems Analysis, Object-Oriented Programming and Design, and Data Structures and Algorithms.",
    "highlights": [
      "Formal teaching experience"
    ]
  }
  ]
}